# IsAllowedTagCategory Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationType..::..IsAllowedTagCategory Method
MultiReferenceAnnotationType Class See Also
---
Returns true if tag types belonging to this category can be used with multi-reference annotation types.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool IsAllowedTagCategory(
	ElementId tagCategoryId
)
```

Visual Basic
---
```text
Public Shared Function IsAllowedTagCategory ( _
	tagCategoryId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsAllowedTagCategory(
	ElementId^ tagCategoryId
)
```

# ### Parameters
tagCategoryId
    Type: Autodesk.Revit.DB..::..ElementId The tag category to test.
# Remarks
Only Structural Rebar Tags are allowed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace